# This file was automatically generated at 2025-04-28 09:41:33
# If there is any issue, please edit song_chart_known_bpm.py instead of this file.

from common.chart_factory import BPM
from typing import *

known_bpms: Dict[int, List[Union[
    Tuple[BPM, Tuple[int, int]],
    Tuple[BPM, Tuple[int, int], bool]
]]] = {
    1: [ # Ambitious Eve (Auto)
        (BPM(177, 0.0000), (2, 4)),
    ],
    2: [ # 夢咲きAfter school (Auto)
        (BPM(175, 0.0000), (4, 4)),
    ],
    3: [ # ヒカリのdestination (Auto)
        (BPM(170, 0.0000), (4, 4)),
    ],
    4: [ # バベルシティ・グレイス (Auto)
        (BPM(148, 0.0000), (4, 4)),
    ],
    5: [ # Spread the Wings!! (Auto)
        (BPM(170, 0.0000), (4, 4)),
    ],
    6: [ # Multicolored Sky (Auto)
        (BPM(122, 0.0000), (4, 4)),
    ],
    7: [ # いつだって僕らは (Auto)
        (BPM(182, 0.0000), (2, 4)),
    ],
    8: [ # アルストロメリア (Auto)
        (BPM(140, 0.0000), (4, 4)),
    ],
    9: [ # Wandering Dream Chaser (Auto)
        (BPM(178, 0.0000), (4, 4)),
    ],
    10: [ # OH MY GOD (Auto)
        (BPM(180, 0.0000), (4, 4)),
    ],
    11: [ # We can go now! (Auto)
        (BPM(170, 0.0000), (4, 4)),
    ],
    12: [ # NEO THEORY FANTASY (Auto)
        (BPM(150, 0.0000), (4, 4)),
    ],
    13: [ # Hide & Attack (Auto)
        (BPM(192, 0.0000), (2, 4)),
    ],
    14: [ # ビーチブレイバー (Auto)
        (BPM(142, 0.0000), (4, 4)),
    ],
    15: [ # Bloomy! (Auto)
        (BPM(131, 0.0000), (4, 4)),
    ],
    16: [ # 僕らだけの未来の空 (Auto)
        (BPM(185, 0.0000), (4, 4)),
    ],
    17: [ # Black Reverie (Auto)
        (BPM(140, 0.0000), (4, 4)),
    ],
    18: [ # 五ツ座流星群 (Auto)
        (BPM(165, 0.0000), (2, 4)),
    ],
    19: [ # SOS (Auto)
        (BPM(136, 0.0000), (4, 4)),
    ],
    20: [ # ツバサグラビティ (Auto)
        (BPM(163, 0.0000), (4, 4)),
    ],
    21: [ # 常咲の庭 (Auto)
        (BPM(152, 0.0000), (4, 4)),
    ],
    22: [ # Darling you! (Auto)
        (BPM(220, 0.0000), (4, 4)),
    ],
    23: [ # わたしの主人公はわたしだから！ (Auto)
        (BPM(156, 0.0000), (4, 4)),
    ],
    24: [ # ありったけの輝きで (Auto)
        (BPM(159, 0.0000), (4, 4)),
    ],
    25: [ # いつか Shiny Days (Auto)
        (BPM(164, 0.0000), (4, 4)),
    ],
    26: [ # Twinkle way (Auto)
        (BPM(178, 0.0000), (2, 4)),
    ],
    27: [ # ダブル・イフェクト (Auto)
        (BPM(128, 0.0000), (2, 4)),
    ],
    28: [ # 千夜アリア (Auto)
        (BPM(140, 0.0000), (4, 4)),
    ],
    29: [ # 夢見鳥 (Auto)
        (BPM(166, 0.0000), (4, 4)),
    ],
    30: [ # また明日 (Auto)
        (BPM(210, 0.0000), (4, 4)),
    ],
    33: [ # プラスチック・アンブレラ (Auto)
        (BPM(124, 0.0000), (4, 4)),
    ],
    35: [ # チョコデート・サンデー (Auto)
        (BPM(170, 0.0000), (4, 4)),
    ],
    38: [ # 星をめざして (Auto)
        (BPM(150, 0.0000), (4, 4)),
        (BPM(150, 25.6000), (2, 4)),
        (BPM(149, 26.4000), (2, 4)),
        (BPM(149, 27.2054), (4, 4)),
        (BPM(148, 51.3664), (4, 4)),
        (BPM(149, 59.4746), (4, 4)),
        (BPM(151, 65.9175), (4, 4)),
        (BPM(151, 67.5069), (9, 8)),
        (BPM(151, 90.7519), (11, 8)),
        (BPM(150, 92.9374), (4, 4)),
    ],
    39: [ # 雪・月・風・花 (Auto)
        (BPM(44, 4.0909), (9, 8)),
    ],
    40: [ # 無自覚アプリオリ (Auto)
        (BPM(146, 0.0000), (2, 4)),
    ],
    41: [ # Another Rampage (Auto)
        (BPM(188, 0.0000), (2, 4)),
    ],
    42: [ # 星の声 (Auto)
        (BPM(128, 0.0000), (4, 4)),
    ],
    43: [ # Damascus Cocktail (Auto)
        (BPM(130, 0.0000), (4, 4)),
    ],
    44: [ # Sweet Memories (Auto)
        (BPM(174, 0.0000), (4, 4)),
    ],
    45: [ # ハナマルバッジ (Auto)
        (BPM(155, 0.0000), (4, 4)),
    ],
    46: [ # アポイント・シグナル (Auto)
        (BPM(138, 0.0000), (4, 4)),
    ],
    47: [ # statice (Auto)
        (BPM(214, 0.0000), (4, 4)),
    ],
    48: [ # 神様は死んだ、って (Auto)
        (BPM(130, 0.0000), (4, 4)),
    ],
    49: [ # あおぞらサイダー (Auto)
        (BPM(141, 0.0000), (2, 4)),
    ],
    50: [ # 誰ソ彼アイデンティティー (Auto)
        (BPM(156, 0.0000), (2, 4)),
    ],
    51: [ # Going my way (Auto)
        (BPM(212, 0.0000), (4, 4)),
    ],
    52: [ # HAREBARE!! (Auto)
        (BPM(82.5, 0.3636), (2, 4)),
    ],
    53: [ # Catch the Breeze (Auto)
        (BPM(232, 0.0000), (4, 4)),
    ],
    85: [ # Timeless Shooting Star (Auto)
        (BPM(128, 0.0000), (2, 4)),
    ],
    95: [ # Give me some more... (Auto)
        (BPM(128, 0.0000), (2, 4)),
    ],
    96: [ # 裸足じゃイラレナイ (Auto)
        (BPM(176, 0.0000), (4, 4)),
    ],
    97: [ # 明日もBeautiful Day (Auto)
        (BPM(192, 0.0000), (4, 4)),
    ],
    98: [ # Fashionable (Auto)
        (BPM(130, 0.0000), (2, 4)),
    ],
    100: [ # 青空 (Auto)
        (BPM(200, 0.0000), (4, 4)),
    ],
    101: [ # ハナムケのハナタバ (Auto)
        (BPM(134, 0.0000), (2, 4)),
    ],
    102: [ # フェアリー・ガール (Auto)
        (BPM(198, 0.0000), (4, 4)),
    ],
    103: [ # Look up to the sky (Auto)
        (BPM(214, 0.0000), (4, 4)),
    ],
    104: [ # Happier (Auto)
        (BPM(160, 0.0000), (4, 4)),
    ],
    105: [ # 枕木の歌 (Auto)
        (BPM(208, 0.0000), (4, 4)),
    ],
    106: [ # 星の声(Another ver.) (Auto)
        (BPM(128, 0.0000), (4, 4)),
    ],
    107: [ # くだらないや (Auto)
        (BPM(182, 0.0000), (4, 4)),
    ],
    108: [ # 時限式狂騒ワンダーランド (Auto)
        (BPM(150, 0.0000), (2, 4)),
        (BPM(206, 22.4000), (4, 4)),
        (BPM(206, 73.6621), (2, 4)),
        (BPM(156.0149, 74.2447), (2, 4)),
        (BPM(103, 85.7820), (3, 4)),
        (BPM(103, 111.9956), (4, 4)),
        (BPM(150, 114.3257), (2, 4)),
    ],
    109: [ # LINKs (Auto)
        (BPM(176, 0.0000), (2, 4)),
    ],
    110: [ # mellow mellow (Auto)
        (BPM(150, 0.0000), (4, 4)),
    ],
    111: [ # C’mon! Join Us (Auto)
        (BPM(125, 0.0000), (2, 4)),
    ],
    112: [ # After Run (Auto)
        (BPM(160, 0.0000), (2, 4)),
    ],
    113: [ # 愛なView (Auto)
        (BPM(194, 0.0000), (4, 4)),
    ],
    115: [ # グッバイ (Auto)
        (BPM(150, 0.0000), (4, 4)),
    ],
    116: [ # Heads or Tails？ (Auto)
        (BPM(131, 0.0000), (4, 4)),
    ],
    117: [ # ツバサグラビティ(アニメOP ver.) (Auto)
        (BPM(163, 0.0000), (4, 4)),
    ],
    118: [ # サマーサマーオーシャンパーリィバケーション (Auto)
        (BPM(142, 0.0000), (2, 4)),
    ],
    122: [ # Shower of light (Auto)
        (BPM(204, 0.0000), (2, 4)),
        (BPM(404, 23.5294), (12, 8)),
        (BPM(102, 37.7868), (3, 8)),
        (BPM(102, 38.6692), (6, 8)),
        (BPM(203, 49.2574), (4, 4)),
        (BPM(204, 53.9865), (4, 4)),
        (BPM(201, 79.8688), (4, 4)),
        (BPM(203, 82.2569), (2, 4)),
        (BPM(205, 91.7150), (4, 4)),
        (BPM(205, 92.8858), (3, 4)),
        (BPM(102, 99.9102), (2, 4)),
    ],
    123: [ # 快盗Vを見逃すな (Auto)
        (BPM(156, 0.0000), (2, 4)),
    ],
    124: [ # 無垢 (Auto)
        (BPM(129, 0.0000), (4, 4)),
    ],
    125: [ # Real Mind Shakes (Auto)
        (BPM(188, 0.0000), (2, 4)),
        (BPM(160, 72.7660), (2, 4)),
        (BPM(188, 87.7660), (2, 4)),
    ],
    126: [ # THE LAST PRIDE (Auto)
        (BPM(180, 0.0000), (2, 4)),
    ],
    128: [ # SWEET♡STEP (Auto)
        (BPM(180, 0.0000), (2, 4)),
    ],
    129: [ # 輝きにかわる (Auto)
        (BPM(131, 0.0000), (2, 4)),
    ],
    130: [ # ONE STAR (Auto)
        (BPM(166, 0.0000), (2, 4)),
    ],
    131: [ # GOTCHA (Auto)
        (BPM(92.5, 0.0000), (2, 4)),
    ],
    133: [ # バベルシティ・グレイス(アニメ ver.) (Auto)
        (BPM(148.1500, 0.0000), (4, 4)),
    ],
    134: [ # アルストロメリア(アニメ ver.) (Auto)
        (BPM(140.1400, 0.0000), (2, 4)),
    ],
    135: [ # 夢咲きAfter school(アニメ ver.) (Auto)
        (BPM(175.1799, 0.0000), (2, 4)),
    ],
    136: [ # ヒカリのdestination(アニメ ver.) (Auto)
        (BPM(170.1700, 0.0000), (4, 4)),
    ],
    137: [ # シャニアニ283プロLIVEメドレー (Auto)
        (BPM(140.1403, 0.0000), (2, 4)),
        (BPM(124.1198, 41.1017), (2, 4)),
        (BPM(177.1805, 81.7076), (4, 4)),
        (BPM(238.2391, 118.2805), (4, 4)),
    ],
    138: [ # Spread the Wings!!(アニメ ver.) (Auto)
        (BPM(170.1698, 0.0000), (4, 4)),
    ],
    140: [ # Poison Berry Daughters (Auto)
        (BPM(154, 0.0000), (2, 4)),
    ],
    141: [ # プリズムフレア (Auto)
        (BPM(175, 0.0000), (2, 4)),
    ],
    142: [ # Fading Stars (Auto)
        (BPM(128, 0.0000), (4, 4)),
    ],
    145: [ # 愛しき日々 (Auto)
        (BPM(186, 0.6452), (4, 4)),
    ],
    146: [ # VOY@GER (Auto)
        (BPM(138, 0.8696), (4, 4)),
    ],
    154: [ # プリズムフレア(アニメOP ver.) (Auto)
        (BPM(175, 0.0000), (4, 4)),
    ],
    155: [ # Wandering Dream Chaser(アニメ ver.) (Auto)
        (BPM(178.1797, 0.0000), (4, 4)),
    ],
    156: [ # OPEN the New world(アニメ ver.) (Auto)
        (BPM(192.1901, 0.0000), (2, 4)),
    ],
    157: [ # Midnight parade!(アニメ ver.) (Auto)
        (BPM(80.0124, 0.0000), (6, 8)),
        (BPM(154, 7.1286), (3, 4), True),
        (BPM(154, 8.2974), (1, 4)),
        (BPM(142.1219, 8.6870), (1, 4)),
        (BPM(142.1219, 9.1092), (12, 8)),
        (BPM(170.1645, 11.2132), (9, 8), True),
        (BPM(148.8899, 11.9477), (9, 8), True),
        (BPM(148.8899, 13.7611), (3, 4)),
        (BPM(74.0750, 14.9701), (3, 4)),
        (BPM(74.0750, 17.4000), (2, 4)),
    ],
    158: [ # ねぇ、ねぇ、ねぇ(アニメ ver.) (Auto)
        (BPM(120.1203, 0.0000), (2, 4)),
    ],
    159: [ # CANDY UNIVERSE(アニメ ver.) (Auto)
        (BPM(154.1411, 0.7748), (2, 4)),
    ],
    160: [ # いつだって僕らは(アニメ ver.) (Auto)
        (BPM(182.1901, 0.0000), (2, 4)),
    ],
    161: [ # 橙より未来(アニメ ver.) (Auto)
        (BPM(148.1594, 0.0000), (4, 4)),
    ],
    162: [ # With you(アニメ ver.) (Auto)
        (BPM(236.2203, 0.0000), (4, 4)),
    ],
    163: [ # Future Designer(アニメ ver.) (Auto)
        (BPM(200.2104, 0.5994), (4, 4)),
    ],
    164: [ # さあ舞い上がれ(アニメ ver.) (Auto)
        (BPM(165, 0.0000), (2, 4)),
    ],
    165: [ # 未来へのSign(アニメ ver.) (Auto)
        (BPM(133.1200, 0.0000), (2, 4)),
    ],
    166: [ # 星の数だけ(アニメ ver.) (Auto)
        (BPM(128.1199, 0.0000), (2, 4)),
    ],

}