# This file was automatically generated at 2025-04-26 11:46:22
# If there is any issue, please edit song_chart_known_bpm.py instead of this file.

from common.chart_factory import BPM
from typing import *

known_bpms: Dict[int, List[Union[
    Tuple[BPM, Tuple[int, int]],
    Tuple[BPM, Tuple[int, int], bool]
]]] = {
    1: [ # ワナビスタ！ (Auto)
        (BPM(118, 1.0169), (4, 4)),
    ],
    2: [ # トゥ・オブ・アス (Auto)
        (BPM(121, 0.1240), (4, 4)),
    ],
    3: [ # 勿忘唄 (Auto)
        (BPM(100, 0.0000), (4, 4)),
    ],
    4: [ # 夢見月夜 (Auto)
        (BPM(85, 0.7059), (4, 4)),
    ],
    5: [ # 悠久月華 (Auto)
        (BPM(82, 0.0000), (4, 4)),
    ],
    6: [ # ダイヤモンドの誓い (Auto)
        (BPM(132, 1.5909), (4, 4)),
    ],
    7: [ # 魔法のラストノート (Auto)
        (BPM(238, 0.0000), (4, 4)),
    ],
    8: [ # New Nostalgic Friend (Auto)
        (BPM(102, 0.0000), (4, 4)),
    ],
    9: [ # Drawing World (Auto)
        (BPM(126, 0.9524), (4, 4)),
    ],
    10: [ # 名もなき恋人よ (Auto)
        (BPM(88, 0.0000), (4, 4)),
    ],
    11: [ # Etoile (Auto)
        (BPM(73, 0.0000), (6, 8)),
    ],
    12: [ # Masquerade (Auto)
        (BPM(116, 0.0000), (4, 4)),
    ],
    13: [ # Farewell song (Auto)
        (BPM(99, 0.0000), (4, 4)),
    ],
    14: [ # Eternity (Auto)
        (BPM(85, 0.1765), (4, 4)),
    ],
    15: [ # Decide (Auto)
        (BPM(87, 0.0000), (4, 4)),
    ],
    16: [ # ウタカタメロディ (Auto)
        (BPM(132, 0.9091), (4, 4)),
    ],
    17: [ # シリウスの輝きのように (Auto)
        (BPM(158, 0.7595), (4, 4)),
        (BPM(200, 64.5570), (4, 4)),
    ],
    19: [ # Faith in Expression (Auto)
        (BPM(140, 0.0000), (2, 4)),
    ],
    21: [ # プラネタリウム・レヴュー (Auto)
        (BPM(170, 0.7059), (4, 4)),
    ],
    23: [ # デアエ・エクス・マキナ！ (Auto)
        (BPM(175, 0.6857), (4, 4)),
    ],
    25: [ # Binary Star (Auto)
        (BPM(190, 0.0000), (4, 4)),
    ],
    26: [ # 暁星アストレーション (Auto)
        (BPM(200, 0.0000), (2, 4)),
    ],
    27: [ # 情熱リベレイション (Auto)
        (BPM(193, 0.0000), (4, 4)),
    ],
    28: [ # プレイ・マイ・フェイバリット!! (Auto)
        (BPM(180, 0.5000), (4, 4)),
    ],
    29: [ # 幾億の星の空で (Auto)
        (BPM(78, 0.0000), (4, 4)),
    ],
    30: [ # 純粋と奔放 (Auto)
        (BPM(134, 0.0000), (4, 4)),
    ],
    31: [ # 心という名の不可解 (Auto)
        (BPM(152, 0.5921), (2, 4)),
    ],
    33: [ # Snow halation (Auto)
        (BPM(173, 0.0000), (4, 4)),
    ],
    34: [ # フォニイ (Auto)
        (BPM(170, 0.3529), (2, 4)),
    ],
    35: [ # チューリングラブ (Auto)
        (BPM(142, 0.0000), (4, 4)),
    ],
    37: [ # Shiny Smily Story (Auto)
        (BPM(168, 0.5357), (4, 4)),
    ],
    38: [ # 変わらないもの (Auto)
        (BPM(75, 0.0000), (9, 8)),
        (BPM(79, 5.4750), (9, 8), True),
        (BPM(79, 2.0573), (11, 8)),
        (BPM(76, 6.2345), (9, 8)),
        (BPM(80, 8.1682), (9, 8), True),
        (BPM(82, 12.4157), (3, 4), True),
        (BPM(82, 10.2206), (4, 4)),
        (BPM(76, 13.1474), (3, 4)),
        (BPM(77, 13.9368), (9, 8), True),
        (BPM(78, 14.7161), (3, 4), True),
        (BPM(78, 19.3315), (2, 4)),
        (BPM(79, 20.8699), (7, 4)),
        (BPM(79, 26.1864), (12, 8)),
        (BPM(79, 21.6294), (3, 4)),
        (BPM(78, 23.9079), (5, 4)),
        (BPM(78, 27.7541), (4, 4)),
        (BPM(78, 33.9079), (3, 4)),
        (BPM(80, 36.2156), (11, 8)),
        (BPM(80, 40.3406), (9, 8)),
        (BPM(75, 36.9656), (5, 4)),
        (BPM(75, 40.9656), (9, 8)),
        (BPM(76, 39.1172), (9, 8), True),
        (BPM(80, 40.1040), (9, 8), True),
        (BPM(78, 42.3732), (12, 8), True),
        (BPM(74, 47.7523), (9, 8), True),
        (BPM(40, 49.3038), (9, 8), True),
        (BPM(40, 42.5538), (5, 4)),
        (BPM(78.4929, 50.0538), (4, 4)),
        (BPM(78.4929, 53.1114), (3, 4)),
        (BPM(38.5505, 50.8182), (9, 8)),
        (BPM(38.5505, 43.8144), (5, 4)),
        (BPM(37.9027, 51.5964), (5, 4)),
        (BPM(37.9027, 59.5114), (9, 8)),
        (BPM(77.4493, 52.3879), (3, 4)),
        (BPM(77.4493, 50.0638), (4, 4)),
        (BPM(79.6474, 53.1626), (9, 8)),
        (BPM(79.6474, 53.1626), (3, 4)),
        (BPM(39.1492, 55.4226), (9, 8)),
        (BPM(39.1492, 48.5259), (5, 4)),
        (BPM(76.2000, 56.1889), (4, 4)),
        (BPM(76.2000, 59.3385), (3, 4)),
        (BPM(37.2255, 56.9763), (9, 8)),
        (BPM(75.4527, 57.7821), (9, 8), True),
        (BPM(82, 58.5773), (9, 8), True),
        (BPM(82, 55.2846), (11, 8)),
        (BPM(81, 59.3090), (4, 4)),
        (BPM(81, 62.2720), (3, 4)),
        (BPM(78, 60.0497), (3, 4)),
        (BPM(76, 60.8190), (9, 8), True),
        (BPM(76, 57.2664), (11, 8)),
        (BPM(79, 61.6085), (4, 4)),
        (BPM(79, 64.6464), (9, 8)),
        (BPM(76.0071, 67.7254), (9, 8), True),
        (BPM(77, 73.8930), (9, 8), True),
        (BPM(81, 77.0015), (9, 8), True),
        (BPM(79, 80.0609), (3, 4), True),
        (BPM(78, 86.2016), (3, 4), True),
        (BPM(78, 90.8170), (4, 4)),
        (BPM(77, 93.8939), (9, 8)),
        (BPM(77, 90.3874), (11, 8)),
        (BPM(83, 94.6731), (5, 4)),
        (BPM(83, 98.2876), (9, 8)),
        (BPM(79, 95.3960), (9, 8), True),
        (BPM(78, 97.9164), (3, 4), True),
        (BPM(75, 99.4625), (9, 8), True),
        (BPM(81, 100.0625), (9, 8), True),
        (BPM(81, 96.7292), (11, 8)),
        (BPM(80, 100.8032), (5, 4)),
        (BPM(80, 104.5532), (9, 8)),
        (BPM(41, 101.5533), (9, 8), True),
        (BPM(41, 94.9679), (5, 4)),
        (BPM(74, 102.2850), (11, 8)),
        (BPM(74, 106.7445), (9, 8)),
        (BPM(77.7769, 103.0958), (9, 8)),
        (BPM(77.7769, 110.0388), (3, 4)),
        (BPM(76, 112.3531), (9, 8)),
        (BPM(74.2996, 115.4076), (3, 4), True),
        (BPM(76, 118.5492), (9, 8), True),
        (BPM(78, 120.2060), (9, 8), True),
    ],
    39: [ # Realize (Auto)
        (BPM(206, 0.0000), (4, 4)),
    ],
    40: [ # 魔法少女とチョコレゐト (Auto)
        (BPM(150, 0.0000), (4, 4)),
    ],
    41: [ # 怪物 (Auto)
        (BPM(170, 0.0000), (4, 4)),
    ],
    42: [ # 六兆年と一夜物語 (Manual)
        (BPM(80, 0.7500), (4, 4)),
        (BPM(77.5, 3.7500), (4, 4)),
        (BPM(75, 4.5242), (4, 4)),
        (BPM(82, 5.3242), (4, 4)),
        (BPM(78, 6.0559), (4, 4)),
        (BPM(73.5, 6.8251), (5, 4)),
        (BPM(72.5, 7.6415), (5, 4)),
        (BPM(79, 8.4690), (5, 4)),
        (BPM(72.2500, 9.1652), (5, 4)),
        (BPM(56.8500, 9.5803), (5, 4)),
        (BPM(56.8500, 10.2839), (4, 4), True),
        (BPM(186, 11.3394), (4, 4)),
        (BPM(139, 120.6942), (4, 4)),
        (BPM(125, 121.1258), (4, 4)),
        (BPM(117.5, 122.5658), (4, 4)),
        (BPM(186, 123.5871), (4, 4)),
    ],
    43: [ # 名前のない怪物 (Auto)
        (BPM(180, 0.0000), (4, 4)),
    ],
    44: [ # アタシのアシタはアタシがキメル (Auto)
        (BPM(182, 0.0000), (4, 4)),
        (BPM(140, 23.7363), (2, 4)),
        (BPM(182, 39.1648), (4, 4)),
    ],
    45: [ # Blondie Revenge Tragedy (Auto)
        (BPM(145, 1.4483), (4, 4)),
        (BPM(210, 80.8966), (12, 8)),
    ],
    46: [ # Fernweh (Auto)
        (BPM(80, 0.0000), (4, 4)),
    ],
    47: [ # サマーバカンス☆アクトレス！ (Auto)
        (BPM(142, 0.6338), (4, 4)),
    ],
    48: [ # I Wanna (Auto)
        (BPM(200, 0.0000), (2, 4)),
    ],
    49: [ # パーティー・ジョーク・シンデレラ (Auto)
        (BPM(100, 1.2000), (4, 4)),
    ],
    50: [ # てぃだんちゅ MEETS てぃんがーら！ (Auto)
        (BPM(150, 0.2000), (4, 4)),
    ],
    51: [ # 夏の夜空に光る雪 (Auto)
        (BPM(115, 0.5217), (4, 4)),
    ],
    53: [ # 電脳スペクタクル (Auto)
        (BPM(220, 0.0000), (4, 4)),
    ],
    54: [ # ひとりの夜のフィルモグラフィー (Auto)
        (BPM(105, 0.8571), (4, 4)),
    ],
    55: [ # ANIMA (Auto)
        (BPM(193, 0.6218), (4, 4)),
    ],
    56: [ # フレーフレー・ファンファーレ！ (Auto)
        (BPM(162, 0.5556), (4, 4)),
    ],
    57: [ # Black Diary (Auto)
        (BPM(138, 0.2174), (4, 4)),
    ],
    58: [ # Pandastic Stage! (Auto)
        (BPM(180, 1.0000), (4, 4)),
    ],
    59: [ # 血を着飾る栄華のために (Auto)
        (BPM(168, 0.0000), (4, 4)),
    ],
    60: [ # シル・ヴ・プレジデント (Auto)
        (BPM(176, 0.0000), (4, 4)),
    ],
    61: [ # 巡る暦の花のように (Auto)
        (BPM(94, 0.0000), (4, 4)),
    ],
    62: [ # 革命ダンス (Auto)
        (BPM(174, 0.1724), (4, 4)),
    ],
    63: [ # マイ・ピクチャー・ストーリー (Auto)
        (BPM(127, 0.7087), (4, 4)),
    ],
    64: [ # きらり！マジカリュー・スマイル！ (Auto)
        (BPM(175, 0.6857), (4, 4)),
    ],
    65: [ # adrenaline!!! (Auto)
        (BPM(134, 0.0000), (4, 4)),
    ],
    66: [ # Forbidden Fruit Addiction (Auto)
        (BPM(152, 0.1974), (4, 4)),
    ],
    67: [ # So long, Say Goodbye (Auto)
        (BPM(86, 0.1744), (4, 4)),
    ],
    68: [ # 夢のステラリウム (Auto)
        (BPM(154, 0.7792), (3, 4)),
        (BPM(154, 10.1299), (2, 4)),
        (BPM(178, 10.9091), (4, 4)),
    ],
    69: [ # トゥインクル・トゥインクル・スクールデイズ！ (Auto)
        (BPM(180, 0.0000), (4, 4)),
    ],
    70: [ # ちいさないのちのさけるばしょ (Auto)
        (BPM(209, 0.0000), (3, 4)),
    ],
    71: [ # いろはうたBLOOMING (Auto)
        (BPM(104, 0.0000), (4, 4)),
    ],
    72: [ # DAYBREAK FRONTLINE (Auto)
        (BPM(136, 0.0000), (4, 4)),
    ],
    73: [ # フタリノスタルジア (Auto)
        (BPM(160, 0.3750), (4, 4)),
    ],
    74: [ # Get to Act Life♡ (Auto)
        (BPM(166, 0.1807), (4, 4)),
    ],
    75: [ # こんなに素晴らしい世界で (Auto)
        (BPM(133, 0.2256), (4, 4)),
        (BPM(146, 12.8571), (2, 4)),
    ],
    76: [ # 不可逆的運命ディストピア (Auto)
        (BPM(280, 0.2143), (4, 4)),
    ],
    77: [ # 小さな奇跡の降る夜に (Auto)
        (BPM(141, 0.2128), (4, 4)),
    ],
    78: [ # トウキョウ・シャンディ・ランデヴ (Auto)
        (BPM(137, 0.5474), (4, 4)),
    ],
    79: [ # HAPPY NEW SHOW TIME! (Auto)
        (BPM(177, 0.3390), (4, 4)),
    ],
    81: [ # アンプレザント・ライン (Auto)
        (BPM(127, 0.0000), (4, 4)),
    ],
    82: [ # アイ・ウィル！ (Auto)
        (BPM(184, 0.1630), (2, 4)),
    ],
    83: [ # Rolling Stone (Auto)
        (BPM(172, 0.1744), (2, 4)),
    ],
    84: [ # かくれんぼ (Auto)
        (BPM(180, 0.0000), (4, 4)),
    ],
    85: [ # Surges (Auto)
        (BPM(137, 0.2190), (4, 4)),
    ],
    86: [ # アスノヨゾラ哨戒班 (Auto)
        (BPM(185, 0.1622), (4, 4)),
    ],
    87: [ # 可愛くてごめん (Auto)
        (BPM(160, 0.0000), (4, 4)),
    ],
    88: [ # 幻日ミステリウム (Auto)
        (BPM(151, 0.1987), (4, 4)),
    ],
    89: [ # ウタカタララバイ (Auto)
        (BPM(178, 0.7584), (4, 4)),
    ],
    90: [ # NEO SKY, NEO MAP! (Auto)
        (BPM(142, 0.8451), (4, 4)),
    ],
    91: [ # ミックス・アップ・インタレスト！ (Auto)
        (BPM(138, 0.6522), (2, 4)),
    ],
    92: [ # Crystal Bell (Auto)
        (BPM(87, 0.1724), (4, 4)),
    ],
    93: [ # St. Bitter Sweet (Auto)
        (BPM(142, 0.0000), (4, 4)),
    ],
    94: [ # 賭世遊戯 (Auto)
        (BPM(168, 0.0000), (4, 4)),
    ],
    95: [ # ふぁうすと・いんぷれっしょん！！ (Auto)
        (BPM(180, 0.2500), (4, 4)),
    ],
    96: [ # ハチメンロッピング！ (Auto)
        (BPM(208, 0.2885), (4, 4)),
    ],
    97: [ # To B-eat, or not to B-eat! (Auto)
        (BPM(116, 0.0000), (2, 4)),
        (BPM(150, 5.1724), (2, 4)),
        (BPM(184, 5.9724), (4, 4)),
        (BPM(155, 9.8855), (4, 4)),
        (BPM(145, 43.9500), (9, 8)),
        (BPM(145, 43.9500), (2, 4)),
        (BPM(165, 44.7776), (2, 4)),
        (BPM(165, 45.5048), (4, 4)),
        (BPM(154.9854, 51.3230), (9, 8)),
        (BPM(154.9854, 51.3230), (4, 4)),
        (BPM(145, 52.8715), (4, 4)),
        (BPM(152, 54.5267), (3, 4)),
        (BPM(157, 56.8951), (2, 4)),
        (BPM(157, 57.6595), (9, 8)),
        (BPM(157, 67.9779), (3, 4)),
        (BPM(164, 69.1244), (6, 8)),
        (BPM(172, 70.2220), (2, 4)),
        (BPM(172, 70.9197), (4, 4)),
        (BPM(72.5, 86.2685), (4, 4)),
        (BPM(72.5, 89.5789), (3, 4)),
        (BPM(155, 87.0961), (4, 4)),
    ],
    98: [ # MY FIRST ACT！ (Auto)
        (BPM(224, 0.8036), (4, 4)),
    ],
    99: [ # 深度異症候群-Shindoi Syndrome- (Auto)
        (BPM(153, 0.0000), (4, 4)),
    ],
    100: [ # Singin' little blue bird (Auto)
        (BPM(126, 0.0000), (4, 4)),
    ],
    101: [ # ハートフル・レシピ (Auto)
        (BPM(141, 0.6383), (4, 4)),
    ],
    102: [ # Friends Per Second (Auto)
        (BPM(120, 0.2500), (2, 4)),
    ],
    103: [ # 眩しい朝日に照らされて (Auto)
        (BPM(180, 0.0000), (4, 4)),
    ],
    104: [ # 夕焼け色は始まりの色 (Auto)
        (BPM(170, 0.4706), (4, 4)),
    ],
    105: [ # 銀月照らす美しき罪 (Auto)
        (BPM(148, 0.2027), (4, 4)),
    ],
    106: [ # アクト・レゾナンス (Auto)
        (BPM(178, 1.0112), (4, 4)),
    ],
    108: [ # Thirsty Soul (Auto)
        (BPM(258, 0.0000), (4, 4)),
    ],
    109: [ # Wish upon a star (Auto)
        (BPM(234, 0.0000), (4, 4)),
    ],
    110: [ # ワンダフル・フラワー・ガーデン！ (Auto)
        (BPM(145, 0.0000), (4, 4)),
    ],
    111: [ # リアルタイム・リプライ！ (Auto)
        (BPM(127, 0.0000), (4, 4)),
    ],
    112: [ # マン・ハン・チュエンシー!! (Auto)
        (BPM(120, 0.0000), (4, 4)),
        (BPM(115, 6.0000), (2, 4)),
        (BPM(115, 7.0435), (4, 4)),
        (BPM(110, 7.0435), (9, 8)),
        (BPM(110, 7.0435), (2, 4)),
        (BPM(160, 8.1344), (4, 4)),
    ],
    113: [ # 雪は春に、そして花束を (Auto)
        (BPM(160, 0.0000), (4, 4)),
    ],
    115: [ # 惑う星達のダンスホール (Auto)
        (BPM(132, 0.0000), (4, 4)),
    ],
    116: [ # Like Blooming Flowers (Auto)
        (BPM(135, 0.0000), (2, 4)),
    ],
    117: [ # 水際PARTY、水着でFUNNY (Auto)
        (BPM(185, 0.0000), (4, 4)),
    ],
    118: [ # あの夏が飽和する。 (Auto)
        (BPM(90, 0.6667), (4, 4)),
    ],
    119: [ # Stellar Stellar (Auto)
        (BPM(164, 0.7317), (4, 4)),
        (BPM(169, 5.1220), (4, 4)),
        (BPM(178, 6.5421), (4, 4)),
        (BPM(178, 117.1039), (3, 4)),
        (BPM(164, 118.1151), (3, 8)),
        (BPM(164, 118.6639), (12, 8)),
    ],
    120: [ # Nameless Story (Auto)
        (BPM(195, 0.6154), (4, 4)),
    ],
    121: [ # Another colony (Auto)
        (BPM(169, 0.5325), (4, 4)),
    ],
    122: [ # ただ声一つ (Auto)
        (BPM(130, 0.6923), (4, 4)),
    ],
    123: [ # ヴァンパイア (Auto)
        (BPM(164, 0.9146), (4, 4)),
    ],
    124: [ # エジソン (Auto)
        (BPM(130, 0.4615), (4, 4)),
    ],
    125: [ # 強風オールバック (Auto)
        (BPM(135, 0.0000), (4, 4)),
    ],
    128: [ # オドループ (Auto)
        (BPM(172, 0.1744), (4, 4)),
    ],
    129: [ # 忘れじの言の葉 (Auto)
        (BPM(135, 0.0000), (3, 4)),
    ],
    130: [ # Virtual to LIVE (Auto)
        (BPM(156, 0.0000), (4, 4)),
    ],
    132: [ # 檄!帝国華撃団 (Auto)
        (BPM(142.5500, 0.0000), (4, 4)),
    ],
    135: [ # INTERNET YAMERO (Auto)
        (BPM(185, 0.0000), (4, 4)),
    ],
    136: [ # TOMORROW (Auto)
        (BPM(134, 0.6716), (4, 4)),
    ],
    137: [ # インフェルノ (Auto)
        (BPM(185, 0.0000), (4, 4)),
    ],
    140: [ # ミックスナッツ (Auto)
        (BPM(150, 0.0000), (4, 4)),
    ],
    141: [ # Transcend Lights (Auto)
        (BPM(105, 0.5714), (6, 8)),
    ],
    142: [ # 絆はずっとGrowing Up!!! (Auto)
        (BPM(190, 0.3158), (4, 4)),
    ],
    143: [ # give it up to you (Auto)
        (BPM(174, 0.1724), (4, 4)),
    ],
    144: [ # Y.Y.Y.計画!!!! (Auto)
        (BPM(186, 0.3226), (2, 4)),
    ],
    145: [ # STARTLINER (Auto)
        (BPM(135, 0.8889), (4, 4)),
    ],
    146: [ # 進め！マイウェイ！ (Auto)
        (BPM(160, 0.0000), (4, 4)),
    ],
    147: [ # 撩乱乙女†無双劇 (Auto)
        (BPM(165, 0.0000), (4, 4)),
    ],
    148: [ # めんどーい！やっほーい！ともだち！ (Auto)
        (BPM(195, 0.0000), (4, 4)),
    ],
    149: [ # GODLINESS (Auto)
        (BPM(183, 0.0000), (2, 4)),
    ],
    150: [ # 粛聖!!ロリ神レクイエム☆ (Auto)
        (BPM(165, 0.7273), (4, 4)),
    ],
    152: [ # シャルル (Auto)
        (BPM(145, 0.4138), (4, 4)),
    ],
    153: [ # DISCOTHEQUE (Auto)
        (BPM(143, 0.6294), (4, 4)),
    ],
    154: [ # BiSH-星が瞬く夜に- (Auto)
        (BPM(210, 0.0000), (2, 4)),
    ],
    155: [ # リライト (Auto)
        (BPM(179, 0.0000), (4, 4)),
    ],
    156: [ # COLORS (Auto)
        (BPM(136, 0.0000), (4, 4)),
    ],
    157: [ # Ｏ2 (Auto)
        (BPM(170, 0.1765), (4, 4)),
    ],
    160: [ # 踊る魔法に観る魔法 (Auto)
        (BPM(128, 0.1758), (4, 4)),
    ],
    161: [ # 硝子色の欠片 (Auto)
        (BPM(82, 0.0000), (4, 4)),
    ],
    162: [ # Neustart (Auto)
        (BPM(188, 0.3191), (4, 4)),
    ],
    163: [ # Original Scene (Auto)
        (BPM(168, 0.0000), (4, 4)),
    ],
    164: [ # 色即是空卍Trick is Treat！ (Auto)
        (BPM(145, 0.0000), (4, 4)),
    ],
    165: [ # Sweet Memories (Auto)
        (BPM(186, 0.0000), (4, 4)),
    ],
    166: [ # 史上最幸NEW YEAR! (Auto)
        (BPM(206, 0.0000), (4, 4)),
    ],
    167: [ # プリズム△▽リズム (Auto)
        (BPM(155, 0.0000), (4, 4)),
    ],
    168: [ # ホシシズク (Auto)
        (BPM(182, 0.4945), (4, 4)),
    ],
    169: [ # 花と、雪と、ドラムンベース。 (Auto)
        (BPM(180, 0.0000), (4, 4)),
    ],
    170: [ # Starry Colors (Auto)
        (BPM(177, 0.6780), (4, 4)),
    ],
    171: [ # 星めぐり、果ての君へ。 (Auto)
        (BPM(175, 0.6857), (4, 4)),
    ],
    172: [ # 青空Jumping Heart (Auto)
        (BPM(200, 0.0000), (4, 4)),
    ],
    173: [ # 恋になりたいAQUARIUM (Auto)
        (BPM(139, 0.8633), (4, 4)),
    ],
    174: [ # Landing action Yeah!! (Auto)
        (BPM(147, 0.0000), (4, 4)),
    ],
    175: [ # Believe again (Auto)
        (BPM(140, 0.0000), (4, 4)),
    ],
    176: [ # いーあるふぁんくらぶ (Auto)
        (BPM(145, 0.8276), (4, 4)),
    ],
    177: [ # おちゃめ機能 (Auto)
        (BPM(150, 0.0000), (4, 4)),
    ],
    178: [ # 黎明の残照の果て、新しき光の空へ (Auto)
        (BPM(138, 0.0000), (4, 4)),
        (BPM(142, 5.2174), (4, 4)),
    ],
    179: [ # ヱテルナ・ガラクシア (Auto)
        (BPM(185, 0.3243), (2, 4)),
        (BPM(134, 79.3138), (3, 4), True),
        (BPM(134, 84.6869), (4, 4)),
        (BPM(185, 86.4780), (4, 4)),
    ],
    180: [ # いこうよ！ネバーランドへ (Auto)
        (BPM(162, 0.0000), (4, 4)),
    ],
    181: [ # トーキョー・ウィンター・ミュージック (Auto)
        (BPM(132, 0.0000), (2, 4)),
    ],
    182: [ # 絶対！ニーデリッヒ宣言♡ (Auto)
        (BPM(176, 0.6818), (4, 4)),
    ],
    183: [ # Act on my feelings. (Auto)
        (BPM(128, 0.0000), (4, 4)),
    ],
    184: [ # 蜃気楼の向こう側、君は笑ってくれるかな (Auto)
        (BPM(120, 0.0000), (4, 4)),
    ],
    185: [ # マッピング・マイ・ワールド (Auto)
        (BPM(176, 0.6818), (4, 4)),
    ],
    186: [ # いつか、薄紅の空の下で (Auto)
        (BPM(115, 0.5217), (4, 4)),
    ],
    188: [ # 君というメソッドへ (Auto)
        (BPM(197, 0.3046), (4, 4)),
    ],
    189: [ # 想い出はリタルダンド (Auto)
        (BPM(159, 1.1321), (4, 4)),
    ],
    190: [ # ビビデバ (Auto)
        (BPM(120, 0.0000), (4, 4)),
    ],
    191: [ # 愛包ダンスホール (Auto)
        (BPM(141, 0.0000), (4, 4)),
    ],
    193: [ # 1・2・3 (Auto)
        (BPM(182, 0.3297), (4, 4)),
        (BPM(67, 109.7309), (9, 8), True),
    ],
    194: [ # オーバーライド (Auto)
        (BPM(204, 0.0000), (4, 4)),
    ],
    195: [ # シャイニングスター (Auto)
        (BPM(158, 0.0000), (4, 4)),
        (BPM(140, 109.3671), (4, 4)),
        (BPM(128, 111.0814), (9, 8)),
    ],
    196: [ # きゅうくらりん (Auto)
        (BPM(220, 0.0000), (4, 4)),
    ],
    198: [ # 青春サイダー (Auto)
        (BPM(160, 0.1875), (4, 4)),
    ],
    199: [ # SHINY DAYS (Auto)
        (BPM(110, 0.5455), (4, 4)),
    ],
    200: [ # レイドバックジャーニー (Auto)
        (BPM(122, 0.0000), (2, 4)),
    ],
    201: [ # Worlds Dye Star (Auto)
        (BPM(117, 0.0000), (4, 4)),
    ],
    202: [ # シャボンに浮かぶセカイであおう (Auto)
        (BPM(125, 0.0000), (4, 4)),
    ],
    209: [ # RAREFIED HEIGHTS (Auto)
        (BPM(227, 0.1322), (2, 4)),
    ],
    210: [ # グローリー・ワンダーランド (Manual)
        (BPM(260, 0.5769), (4, 4)),
        (BPM(235, 50.4231), (4, 4)),
        (BPM(215, 51.4444), (4, 4)),
        (BPM(260, 52.5606), (4, 4)),
        (BPM(230, 104.2529), (4, 4)),
        (BPM(240, 112.6008), (4, 4)),
        (BPM(250, 116.6008), (4, 4)),
        (BPM(260, 117.5608), (4, 4)),
    ],
    249: [ # Stellarium Collection Vol.1 (Auto)
        (BPM(159, 0.0000), (4, 4)),
        (BPM(152, 27.1698), (4, 4)),
        (BPM(123, 52.4330), (4, 4)),
        (BPM(148, 75.8476), (4, 4)),
        (BPM(115, 83.9557), (4, 4)),
        (BPM(123, 100.6514), (4, 4)),
        (BPM(172, 108.4562), (4, 4)),
    ],
    10005: [ # 悠久月華（Long Ver.） (Auto)
        (BPM(82, 0.0000), (4, 4)),
    ],
    10009: [ # Drawing World （Long Ver.） (Auto)
        (BPM(126, 0.9524), (4, 4)),
    ],
    10012: [ # Masquerade（Long Ver.） (Auto)
        (BPM(116, 0.0000), (4, 4)),
    ],
    10017: [ # シリウスの輝きのように（Long Ver.） (Auto)
        (BPM(158, 0.7595), (4, 4)),
        (BPM(200, 64.5570), (4, 4)),
        (BPM(158, 108.9570), (4, 4)),
        (BPM(200, 157.5646), (4, 4)),
        (BPM(158, 198.3646), (2, 4)),
        (BPM(158, 199.1241), (9, 8)),
        (BPM(158, 211.0861), (5, 8)),
        (BPM(200, 212.0354), (4, 4)),
        (BPM(200, 213.2354), (3, 4)),
    ],
    10019: [ # Faith in Expression（Long Ver.） (Auto)
        (BPM(140, 0.0000), (2, 4)),
    ],
    10021: [ # プラネタリウム・レヴュー（Long Ver.） (Auto)
        (BPM(170, 0.7059), (4, 4)),
    ],
    10023: [ # デアエ・エクス・マキナ！（Long Ver.） (Auto)
        (BPM(175, 0.0000), (2, 4)),
    ],
    10025: [ # Binary Star（Long Ver.） (Auto)
        (BPM(190, 0.0000), (4, 4)),
    ],
    10027: [ # 情熱リベレイション（Long Ver.） (Auto)
        (BPM(193, 0.0000), (4, 4)),
    ],
    10028: [ # プレイ・マイ・フェイバリット!!（Long Ver.） (Auto)
        (BPM(180, 0.5000), (4, 4)),
    ],
    10029: [ # 幾億の星の空で（Long Ver.） (Auto)
        (BPM(78, 0.0000), (4, 4)),
    ],
    10030: [ # 純粋と奔放（Long Ver.） (Auto)
        (BPM(134, 0.0000), (4, 4)),
    ],
    10045: [ # Blondie Revenge Tragedy（Long Ver.） (Auto)
        (BPM(145, 1.4483), (4, 4)),
        (BPM(210, 171.9310), (12, 8)),
    ],
    10046: [ # Fernweh（Long Ver.） (Auto)
        (BPM(80, 0.0000), (4, 4)),
    ],
    10047: [ # サマーバカンス☆アクトレス！（Long Ver.） (Auto)
        (BPM(142, 0.6338), (4, 4)),
    ],
    10050: [ # てぃだんちゅ MEETS てぃんがーら！（Long Ver.） (Auto)
        (BPM(150, 0.2000), (4, 4)),
    ],
    10051: [ # 夏の夜空に光る雪（Long Ver.） (Auto)
        (BPM(115, 0.5217), (4, 4)),
    ],
    10053: [ # 電脳スペクタクル（Long Ver.） (Auto)
        (BPM(220, 0.0000), (4, 4)),
    ],
    10057: [ # Black Diary（Long Ver.） (Auto)
        (BPM(138, 0.2174), (4, 4)),
    ],
    10058: [ # Pandastic Stage!（Long Ver.） (Auto)
        (BPM(180, 1.0000), (4, 4)),
    ],
    10061: [ # 巡る暦の花のように（Long Ver.） (Auto)
        (BPM(94, 0.0000), (4, 4)),
    ],
    10064: [ # きらり！マジカリュー・スマイル！（Long Ver.） (Auto)
        (BPM(175, 0.6857), (4, 4)),
    ],
    10066: [ # Forbidden Fruit Addiction（Long Ver.） (Auto)
        (BPM(152, 0.1974), (4, 4)),
    ],
    10068: [ # 夢のステラリウム（Long Ver.） (Auto)
        (BPM(154, 0.7792), (3, 4)),
        (BPM(154, 10.1299), (2, 4)),
        (BPM(178, 10.9091), (4, 4)),
    ],
    10070: [ # ちいさないのちのさけるばしょ（Long Ver.） (Auto)
        (BPM(209, 0.0000), (12, 8)),
    ],
    10071: [ # いろはうたBLOOMING（Long Ver.） (Auto)
        (BPM(104, 0.0000), (4, 4)),
    ],
    10073: [ # フタリノスタルジア（Long Ver.） (Auto)
        (BPM(160, 0.3750), (4, 4)),
    ],
    10074: [ # Get to Act Life♡（Long Ver.） (Auto)
        (BPM(166, 0.1807), (4, 4)),
    ],
    10076: [ # 不可逆的運命ディストピア（Long Ver.） (Auto)
        (BPM(280, 0.2143), (4, 4)),
    ],
    10077: [ # 小さな奇跡の降る夜に（Long Ver.） (Auto)
        (BPM(141, 0.2128), (4, 4)),
    ],
    10079: [ # HAPPY NEW SHOW TIME!（Long Ver.） (Auto)
        (BPM(177, 0.3390), (4, 4)),
    ],
    10082: [ # アイ・ウィル！（Long Ver.） (Auto)
        (BPM(184, 0.1630), (4, 4)),
    ],
    10092: [ # Crystal Bell（Long Ver.） (Auto)
        (BPM(87, 0.1724), (4, 4)),
    ],
    10093: [ # St. Bitter Sweet（Long Ver.） (Auto)
        (BPM(142, 0.0000), (4, 4)),
    ],
    10094: [ # 賭世遊戯（Long Ver.） (Auto)
        (BPM(168, 0.0000), (4, 4)),
    ],
    10097: [ # To B-eat, or not to B-eat!（Long Ver.） (Auto)
        (BPM(116, 0.0000), (2, 4)),
        (BPM(150, 5.1724), (2, 4)),
        (BPM(184, 5.9724), (4, 4)),
        (BPM(155, 9.8855), (4, 4)),
        (BPM(145, 43.9500), (9, 8)),
        (BPM(145, 43.9500), (2, 4)),
        (BPM(165, 44.7776), (2, 4)),
        (BPM(165, 45.5048), (4, 4)),
        (BPM(154.9854, 51.3230), (9, 8)),
        (BPM(154.9854, 51.3230), (4, 4)),
        (BPM(145, 52.8715), (4, 4)),
        (BPM(152, 54.5267), (3, 4)),
        (BPM(157, 56.8951), (2, 4)),
        (BPM(157, 57.6595), (9, 8)),
        (BPM(157, 67.9779), (3, 4)),
        (BPM(164, 69.1244), (6, 8)),
        (BPM(172, 70.2220), (2, 4)),
        (BPM(172, 70.9197), (4, 4)),
        (BPM(72.5, 86.2685), (4, 4)),
        (BPM(72.5, 89.5789), (3, 4)),
        (BPM(155, 87.0961), (4, 4)),
        (BPM(222, 119.6122), (9, 8)),
        (BPM(222, 131.7744), (3, 4)),
        (BPM(155, 132.5852), (4, 4)),
        (BPM(155, 151.1658), (3, 8)),
        (BPM(152, 151.7465), (5, 4)),
        (BPM(152, 153.7202), (9, 8)),
        (BPM(152, 151.9439), (3, 8)),
        (BPM(149, 152.5360), (5, 4)),
        (BPM(149, 154.5494), (9, 8)),
        (BPM(149, 152.7373), (3, 8)),
        (BPM(146, 153.3413), (5, 4)),
        (BPM(146, 155.3961), (9, 8)),
        (BPM(146, 153.5468), (3, 8)),
        (BPM(143, 154.1633), (5, 8)),
        (BPM(143, 155.2122), (3, 4)),
        (BPM(140, 155.2122), (3, 8)),
        (BPM(140, 155.8551), (9, 8)),
        (BPM(140, 153.9265), (5, 4)),
        (BPM(137, 156.0693), (3, 8)),
        (BPM(137, 156.7263), (9, 8)),
        (BPM(137, 154.7555), (5, 4)),
        (BPM(134, 156.9453), (9, 8)),
        (BPM(157, 159.0019), (12, 8), True),
        (BPM(164, 170.4669), (6, 8)),
        (BPM(172, 171.5644), (2, 4)),
        (BPM(172, 172.2621), (4, 4)),
        (BPM(72.5, 187.6109), (4, 4)),
        (BPM(72.5, 190.9213), (3, 4)),
        (BPM(155, 188.4385), (4, 4)),
    ],
    10100: [ # Singin' little blue bird（Long Ver.） (Auto)
        (BPM(126, 0.0000), (4, 4)),
    ],
    10105: [ # 銀月照らす美しき罪（Long Ver.） (Auto)
        (BPM(148, 0.2027), (4, 4)),
    ],
    10113: [ # 雪は春に、そして花束を（Long Ver.） (Auto)
        (BPM(160, 0.0000), (4, 4)),
    ],

}